<?
header("Access-Control-Allow-Origin: *");
include('safemysql/mysql.class.php');

//Данные сервера (используются например в Едином агенте)

$dirserver = "C:\OSPanel\domains\\docs";
$sitemode = "dev";	// prod - продуктовая/рабочая версия, dev - версия для разработки/тестирования

//Данные для подключения к mysql
$dbhost = "localhost";
$dbbase = "fo_dev";
$dbuser = "root";
$dbpass = "";

//Строка подключения в новом формате
$connect = [
	'host'      => 'localhost',				// хост
	'user'      => 'root',				// пользователь
	'pass'      => '',			// пароль
	'db'      	=> 'fo_dev',			// база данных
	'port'      => NULL,				// порт
	'socket'    => NULL,				// сокет
	'pconnect'  => FALSE,				//
	'charset'   => 'utf8',				// кодировка БД
	'errmode'   => 'exception',			// режим вывода ошибок
	'exception' => 'Exception',			// количество выводимых ошибок (режим)
];


$db = new SafeMySQL($connect);

echo '{
	"IDЗапроса": "a32b3f0a-9349-4e32-83cc-9a2416217792",
	"Источник": "Фронт-офис ОСАГО",
	"Приемник": "УСК",
	"СодержимоеЗапроса": {
		"ГуидАДС": "",
		"ГуидФОС": "113438",
		"IDРСА": "",
		"IDТекущего": "",
		"IDОснования": "",
		"ТипДоговора": "primary",
		"ТСЗарегистрированоВИГ": false,
		"СледованиеКМестуРегистрации": false,
		"СледованияКМестуПроведенияТО": false,
		"ИнфоДоп": [
		],
		"ИдРасчетаКБМ": "",
		"СтраховойПродукт": "ОСАГО",
		"ВариантСтрахования": "",
		"Серия": "МММ",
		"НомерДоговора": "МММ №6002368199",
		"Организация": "000000001",
		"Подразделение": "01-0201030000",
		"БСО": {
			"ТипБСО": "osago",
			"Серия": "МММ",
			"Номер": "6002368199"
		},
		"ДатаНачалаДействияДоговора": "2019-07-26T11:00:00+05:00",
		"ДатаОкончанияДействияДоговора": "2020-07-25T23:59:59+05:00",
		"ПериодСтрахования": "1\/y",
		"ДатаПодписанияДоговора": "2019-07-26T10:55:00+05:00",
		"ОтветственныйЗаПродажу": "0100000481",
		"Агент": "0100001541",
		"РазмерКВ": "",
		"ДоговорГПД": "",
		"МестоЗаключенияДоговора": "47",
		"Страхователь": {
			"GUID": "",
			"ТипСубъекта": "physical",
			"Резидент": true,
			"КБМВодителя": "3",
			"НаименованиеФИО": "",
			"ТипДокумента": "",
			"СерияПаспорта": "",
			"НомерПаспорта": "",
			"СерияВУ": "",
			"НомерВУ": "",
			"ДатаРождения": "",
			"ИНН": "",
			"ИнфоФизЛицо": {
				"Фамилия": "Обухова",
				"ФамилияСтарая": "",
				"Имя": "Варвара",
				"ИмяСтарое": "",
				"Отчество": "Юрьевна",
				"ОтчествоСтарое": "",
				"ДатаРождения": "1996-06-05T00:00:00+06:00",
				"ДатаРожденияСтарая": "",
				"VIP": {
					"Статус": false
				},
				"Гражданство": "643",
				"МестоРождения": "гор. кириши",
				"Пол": "female",
				"ИНН": "",
				"Документы": [
					{
						"ТекущийДокумент": "true",
						"ТипДокумента": "12",
						"Серия": "41 16",
						"Номер": "762996",
						"КемВыдан": "МП № 111 ОУФМС РОССИИ ПО САНКТ-ПЕТЕРБУРГУ И ЛЕНИНГРАДСКОЙ ОБЛ. В КИРИШСКОМ РАЙОНЕ",
						"КодПодразделения": "470-027",
						"СтранаРегистрации": "",
						"ДатаВыдачи": "2016-07-04T00:00:00+05:00",
						"ДействителенДо": ""
					},
					{
						"ТекущийДокумент": "false",
						"ТипДокумента": "20",
						"Серия": "4733",
						"Номер": "653934",
						"КемВыдан": "",
						"КодПодразделения": "",
						"СтранаРегистрации": "",
						"ТипВУ": "Автомобильные",
						"ДатаВыдачи": "2017-12-13T00:00:00+05:00",
						"ДатаНачалаВодитСтажа": "2017-12-13T00:00:00+05:00",
						"ДействителенДо": "2027-12-13T00:00:00+05:00"
					}
				],
				"Карты": [
				],
				"БанковскиеРеквизиты": [
				],
				"КонтактнаяИнформация": [
					{
						"ТипКИ": "phone",
						"КИ": "79516685884",
						"Примечание": "",
						"СМСРассылка": false
					}
				],
				"Адреса": [
					{
						"Тип": "registration",
						"КЛАДР": "47009001000000100",
						"Индекс": "187113",
						"Регион": "Ленинградская обл",
						"Район": "Киришский р-н",
						"Город": "г Кириши",
						"НаселенныйПункт": "",
						"Улица": "Березовый пер",
						"Дом": "2",
						"Корпус": "",
						"Квартира": "2",
						"Другое": ""
					}
				],
				"ФЗ115": [
					{
						"ФЗ115": false,
						"МестоРождения": "гор. кириши",
						"СвязьСПДЛ": false,
						"ЦельОтношения": "",
						"ХарактерОтношений": "000000002",
						"ЦелиФХДеятельности": "",
						"ФинансовоеПоложение": "",
						"ДеловаяРепутация": "000000003",
						"ИсточникДС": "000000001",
						"МерыПоБВ": "",
						"Адрес": "",
						"НеРФ": true,
						"МиграционнаяКарта": [
							{
								"Серия": "",
								"Номер": "",
								"ДатаНачалаСрока": "",
								"ДатаОкончанияСрока": ""
							}
						],
						"ИнойДокумент": [
							{
								"ВидДокумента": "",
								"Серия": "",
								"Номер": "",
								"ДатаНачала": "",
								"ДатаОкончания": ""
							}
						]
					}
				]
			},
			"Фотографии": [
			]
		},
		"СтраховательЯвляетсяСобственником": true,
		"СтраховательЯвляетсяВыгодоприобретателем": "",
		"Собственники": {
			"GUID": "",
			"ТипСубъекта": "physical",
			"Резидент": true,
			"КБМВодителя": "3",
			"НаименованиеФИО": "",
			"ТипДокумента": "",
			"СерияПаспорта": "",
			"НомерПаспорта": "",
			"СерияВУ": "",
			"НомерВУ": "",
			"ДатаРождения": "",
			"ИНН": "",
			"ИнфоФизЛицо": {
				"Фамилия": "Обухова",
				"ФамилияСтарая": "",
				"Имя": "Варвара",
				"ИмяСтарое": "",
				"Отчество": "Юрьевна",
				"ОтчествоСтарое": "",
				"ДатаРождения": "1996-06-05T00:00:00+06:00",
				"ДатаРожденияСтарая": "",
				"VIP": {
					"Статус": false
				},
				"Гражданство": "643",
				"МестоРождения": "гор. кириши",
				"Пол": "female",
				"ИНН": "",
				"Документы": [
					{
						"ТекущийДокумент": "true",
						"ТипДокумента": "12",
						"Серия": "41 16",
						"Номер": "762996",
						"КемВыдан": "МП № 111 ОУФМС РОССИИ ПО САНКТ-ПЕТЕРБУРГУ И ЛЕНИНГРАДСКОЙ ОБЛ. В КИРИШСКОМ РАЙОНЕ",
						"КодПодразделения": "470-027",
						"СтранаРегистрации": "",
						"ДатаВыдачи": "2016-07-04T00:00:00+05:00",
						"ДействителенДо": ""
					},
					{
						"ТекущийДокумент": "false",
						"ТипДокумента": "20",
						"Серия": "4733",
						"Номер": "653934",
						"КемВыдан": "",
						"КодПодразделения": "",
						"СтранаРегистрации": "",
						"ТипВУ": "Автомобильные",
						"ДатаВыдачи": "2017-12-13T00:00:00+05:00",
						"ДатаНачалаВодитСтажа": "2017-12-13T00:00:00+05:00",
						"ДействителенДо": "2027-12-13T00:00:00+05:00"
					}
				],
				"Карты": [
				],
				"БанковскиеРеквизиты": [
				],
				"КонтактнаяИнформация": [
					{
						"ТипКИ": "phone",
						"КИ": "79516685884",
						"Примечание": "",
						"СМСРассылка": false
					}
				],
				"Адреса": [
					{
						"Тип": "registration",
						"КЛАДР": "47009001000000100",
						"Индекс": "187113",
						"Регион": "Ленинградская обл",
						"Район": "Киришский р-н",
						"Город": "г Кириши",
						"НаселенныйПункт": "",
						"Улица": "Березовый пер",
						"Дом": "2",
						"Корпус": "",
						"Квартира": "2",
						"Другое": ""
					}
				],
				"ФЗ115": [
					{
						"ФЗ115": false,
						"МестоРождения": "гор. кириши",
						"СвязьСПДЛ": false,
						"ЦельОтношения": "",
						"ХарактерОтношений": "000000002",
						"ЦелиФХДеятельности": "",
						"ФинансовоеПоложение": "",
						"ДеловаяРепутация": "000000003",
						"ИсточникДС": "000000001",
						"МерыПоБВ": "",
						"Адрес": "",
						"НеРФ": true,
						"МиграционнаяКарта": [
							{
								"Серия": "",
								"Номер": "",
								"ДатаНачалаСрока": "",
								"ДатаОкончанияСрока": ""
							}
						],
						"ИнойДокумент": [
							{
								"ВидДокумента": "",
								"Серия": "",
								"Номер": "",
								"ДатаНачала": "",
								"ДатаОкончания": ""
							}
						]
					}
				]
			},
			"Фотографии": [
			]
		},
		"Оплата": {
			"СтрПремия": "10423.07",
			"Периодичность": "Единовременно",
			"ГрафикПлатежей": [
				{
					"ДатаОчередногоПлатежа": "2019-07-26T00:00:00+05:00",
					"Сумма": "10423.07"
				}
			],
			"ВидОплаты": "Наличный",
			"СпособОплаты": "Наличный",
			"ПлатежейВГод": 1
		},
		"Счета": [
			{
				"НомерСчета": "МММ №6002368199\/0\/\/20-1\/19-1",
				"СуммаСчета": "10423.07",
				"ДатаСозданияСчета": "2019-07-26T00:00:00+05:00",
				"НазначениеПлатежа": "Перечисление страховой премии по счету МММ №6002368199\/0\/\/20-1\/19-1 от 26.07.2019",
				"ДатаГрафика": "2019-07-26T00:00:00+05:00"
			}
		],
		"Платежи": [
			{
				"СпособОплаты": "Наличный",
				"СуммаПлатежа": 10423.07,
				"СерияА7": "",
				"НомерА7": "МММ №6002368199\/0\/\/20-1\/19-1",
				"ДатаА7": "2019-07-26T00:00:00+05:00",
				"IDТранзакции": "20000001\/",
				"ДатаТранзакции": "2019-07-26T00:00:00+05:00",
				"НомерЧека": "",
				"ДатаЧека": ""
			}
		],
		"Водители": [
			{
				"GUID": "",
				"ТипСубъекта": "physical",
				"Резидент": true,
				"КБМВодителя": "3",
				"НаименованиеФИО": "",
				"ТипДокумента": "",
				"СерияПаспорта": "",
				"НомерПаспорта": "",
				"СерияВУ": "",
				"НомерВУ": "",
				"ДатаРождения": "",
				"ИНН": "",
				"ИнфоФизЛицо": {
					"Фамилия": "Обухова",
					"ФамилияСтарая": "",
					"Имя": "Варвара",
					"ИмяСтарое": "",
					"Отчество": "Юрьевна",
					"ОтчествоСтарое": "",
					"ДатаРождения": "1996-06-05T00:00:00+06:00",
					"ДатаРожденияСтарая": "",
					"VIP": {
						"Статус": false
					},
					"Гражданство": "643",
					"МестоРождения": "гор. кириши",
					"Пол": "female",
					"ИНН": "",
					"Документы": [
						{
							"ТекущийДокумент": "false",
							"ТипДокумента": "12",
							"Серия": "41 16",
							"Номер": "762996",
							"КемВыдан": "МП № 111 ОУФМС РОССИИ ПО САНКТ-ПЕТЕРБУРГУ И ЛЕНИНГРАДСКОЙ ОБЛ. В КИРИШСКОМ РАЙОНЕ",
							"КодПодразделения": "470-027",
							"СтранаРегистрации": "",
							"ДатаВыдачи": "2016-07-04T00:00:00+05:00",
							"ДействителенДо": ""
						},
						{
							"ТекущийДокумент": "true",
							"ТипДокумента": "20",
							"Серия": "4733",
							"Номер": "653934",
							"КемВыдан": "",
							"КодПодразделения": "",
							"СтранаРегистрации": "",
							"ТипВУ": "Автомобильные",
							"ДатаВыдачи": "2017-12-13T00:00:00+05:00",
							"ДатаНачалаВодитСтажа": "2017-12-13T00:00:00+05:00",
							"ДействителенДо": "2027-12-13T00:00:00+05:00"
						}
					],
					"Карты": [
					],
					"БанковскиеРеквизиты": [
					],
					"КонтактнаяИнформация": [
						{
							"ТипКИ": "phone",
							"КИ": "79516685884",
							"Примечание": "",
							"СМСРассылка": false
						}
					],
					"Адреса": [
						{
							"Тип": "registration",
							"КЛАДР": "47009001000000100",
							"Индекс": "187113",
							"Регион": "Ленинградская обл",
							"Район": "Киришский р-н",
							"Город": "г Кириши",
							"НаселенныйПункт": "",
							"Улица": "Березовый пер",
							"Дом": "2",
							"Корпус": "",
							"Квартира": "2",
							"Другое": ""
						}
					],
					"ФЗ115": [
						{
							"ФЗ115": false,
							"МестоРождения": "гор. кириши",
							"СвязьСПДЛ": false,
							"ЦельОтношения": "",
							"ХарактерОтношений": "000000002",
							"ЦелиФХДеятельности": "",
							"ФинансовоеПоложение": "",
							"ДеловаяРепутация": "000000003",
							"ИсточникДС": "000000001",
							"МерыПоБВ": "",
							"Адрес": "",
							"НеРФ": true,
							"МиграционнаяКарта": [
								{
									"Серия": "",
									"Номер": "",
									"ДатаНачалаСрока": "",
									"ДатаОкончанияСрока": ""
								}
							],
							"ИнойДокумент": [
								{
									"ВидДокумента": "",
									"Серия": "",
									"Номер": "",
									"ДатаНачала": "",
									"ДатаОкончания": ""
								}
							]
						}
					]
				},
				"Фотографии": [
				]
			}
		],
		"ПериодыИспользованияТС": [
			{
				"ДатаНачала": "2019-07-26T00:00:00+05:00",
				"ДатаОкончания": "2020-07-25T00:00:00+05:00"
			}
		],
		"ОбъектыСтрахования": [
			{
				"ТипОбъекта": "ТС",
				"ОснованиеИспользованияТС": "",
				"ЦельИспользованияТС": "",
				"Марка": "ВАЗ\/Lada",
				"Модель": "2113",
				"МодельПТС": "ВАЗ\/Lada 2113",
				"ТипТС": "ЛегковойАвтомобильФиз",
				"КатегорияТС": "B",
				"Цвет": "",
				"ГодВыпускаНеУстановлен": false,
				"ГодВыпуска": "2007",
				"МесяцВыпуска": "",
				"СрокЭксплуатации": "",
				"КодМоделиРСА": "501017541",
				"VINОтсутствует": false,
				"VIN": "XTA21134074444800",
				"VINПТС": "",
				"ГосНомер": "Р043УА178",
				"НомерКузова": "",
				"НомерДвигателя": "",
				"НомерШасси": "",
				"ТипДокументовТС": "",
				"СерияДокументаТС": "",
				"НомерДокументаТС": "",
				"ДатаВыдачиДокументаТС": "",
				"Пробег": "",
				"МощностьДвигателяЛС": 81,
				"МощностьДвигателяКвт": 59.575,
				"МаксРазрешеннаяМасса": "",
				"КоличествоПассажиромест": "0",
				"СтраховаяСумма": "",
				"БезОсмотраТС": true,
				"ДатаОсмотраТС": "",
				"НомерАктаОсмотраТС": "",
				"Повреждения": false,
				"ОписаниеПовреждений": "",
				"ПрокатТС": false,
				"МестоНочнойСтоянки": "",
				"ДействительнаяСтоимость": "",
				"КолвоКлючей": "",
				"ПричинаНекомплекта": "",
				"НеогрКолво": false,
				"КоличествоВодителей": 1,
				"МинВозраст": "",
				"МинСтаж": "",
				"ТОНеТребуется": false,
				"ПричинаОтсутствияТО": "",
				"ВидДокументаОсмотра": "diagnostic",
				"СерияДокументаОсмотра": "",
				"НомерДокументаОсмотра": "",
				"ДатаВыдачиДокументаОсмотра": "",
				"ДатаСледующегоТО": "",
				"ИспользуетсяПрицеп": false,
				"ТерриторияИспользования": "",
				"ТерриторияРегистрацииДляРСА": "",
				"НаличиеНарушенийУсловийСтрахования": false,
				"КоличествоСтраховыхСлучаев": 0,
				"ТсПересекаетГосГраницу": false,
				"КБМ": 3,
				"КБМРСА": 3,
				"Фотографии": [
				]
			}
		],
		"Расчет": [
			{
				"ТБ": "4118",
				"КТ": "1.3",
				"КБМ": "1",
				"КВС": "1.77",
				"КМ": "1.1",
				"КПр": "1",
				"КС": "1",
				"КП": "1",
				"КН": "1",
				"КО": "1",
				"ФактическаяПремия": "10423.07",
				"РасчетнаяПремия": "10423.07",
				"КБМПоКлассу": "3",
				"ПремияПоРезультатамСРА": "10423.07"
			}
		],
		"ДанныеПредыдущегоДоговора": {
			"Серия": "",
			"Номер": "",
			"Страховщик": "0000-000000027399"
		},
		"КроссПродажа": "",
		"ОсобыеОтметки": "",
		"debug_info": [
		]
	}
}';
?>